Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: ཐེག་པ་ཆེན་པོའི་སྨོན་ལམ་ལས་ཕྱིར་མི་ཟློག་པ་ཡིན་པ་དང་འགྲོ་བ་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་གཟུང་བ་དང་རྣམ་པར་སྤེལ་བ་ལ་སྒྱིད་ལུག་པར་མི་འགྱུར་བ་ཡིན་པ་འདྲིས་ཤིག །
en: How do they never turn back from the prayers of the Mahāyāna? How do they never lose heart in maintaining and increasing the roots of merit of all beings?’ ”

source: དེ་ནས་ཤཱཀྱའི་བུ་མོ་གོ་པས་རྣམ་པར་ཐར་བའི་སྒོའི་ཚུལ་འདི་ཉིད་ཡོངས་སུ་བསྟན་པའི་ཕྱིར་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །ཡང་དག་བྱང་ཆུབ་སྤྱོད་ལ་བརྩོན་པ་ཡི། །སེམས་ཅན་དམ་པ་སེམས་ཅན་སུས་མཐོང་བ། །མོས་པའི་སེམས་སམ་ཁོང་ཁྲོ་ལྡན་ཡང་རུང་། །དེ་ཡི་བསྡུ་བས་ཀུན་ཀྱང་ཡོངས་སུ་འདུ། །
en: Then at that time, Gopā, the Śākya maiden, in order to teach completely this gateway to liberation, through the blessing of the Buddha recited these verses: “The beings who see the supreme beings Who are dedicated to perfect bodhisattva conduct, Whether they are attracted or in enmity, All become gathered by him.

source: ཞིང་བརྒྱའི་རྡུལ་ཕྲན་རབ་ཏུ་ཕྲ་སྙེད་ཀྱི། །བསྐལ་པ་མང་པོ་ཁོ་མོས་འདི་ནས་དྲན། །
en: {90} “I remember as many kalpas As there are atoms in a hundred realms.

source: དེ་ཡི་ཕ་རོལ་བསྐལ་པ་རྣམ་བརྒྱན་ལ། །འཇིག་རྟེན་ཁམས་རབ་རི་བོའི་འོད་བྱུང་ངོ་། །
en: Beyond those there was the Vyūhasa kalpa, In which was the perfect world realm Meruprabhā.

source: དེ་ལ་ཐུབ་པ་སྟོང་ཕྲག་འགྲངས་པ་ནི། །བྱེ་བ་ཁྲག་ཁྲིག་སུམ་ཅུ་དྲུག་བྱུང་སྟེ། །
en: {91} “In that world appeared sages To the number of sixty sextillion.

source: དེ་ཀུན་ཐ་མར་ཐུབ་དབང་བྱུང་བ་ནི། །འགྲོ་བའི་སྒྲོན་མ་ཆོས་ཀྱི་རྒྱལ་མཚན་ནོ། །
en: The last of those lords of sages Was the lamp for beings Dharmadhvaja.

source: དེ་ཚེ་རྒྱལ་པོ་དཔལ་གྱི་གཟི་བརྗིད་བྱུང་། །
en: {92} “At that time there was the King Śrītejas.

source: ཐུབ་དབང་དེ་ནི་མྱ་ངན་ཡོངས་འདས་ནས། །དགྲ་ཡི་འཁོར་བཅོམ་འཛམ་བུའི་རྒྱལ་མཚན་འདིར། །བཀའ་ལ་ཐོགས་མེད་མངའ་བདག་དམ་པར་གྱུར། །
en: After the parinirvāṇa of that lord of sages In this Jambudhvaja, he destroyed the armies of his adversaries And became a supreme sovereign with commands that could not be disobeyed.

source: དེ་ལ་བུ་ནི་བརྒྱ་ཕྲག་ལྔ་ཡོད་དེ། །ཀུན་ཀྱང་དཔའ་ཞིང་བརྟུལ་ཕོད་གཟུགས་དང་ལྡན། །ཡན་ལག་ཀུན་རྫོགས་རྣམ་པར་དག་པའི་ལུས། །གོང་ན་མེད་པའི་དཔལ་གྱིས་རབ་ཏུ་བརྒྱན། །
en: {93} “He had five hundred sons, who were All courageous, heroic, and handsome, With perfectly formed limbs and pure bodies, And who were unsurpassable and adorned by glory.

source: རྒྱལ་པོ་སྲས་བཅས་བདེ་གཤེགས་འདུན་པར་གྱུར། །རྒྱལ་པའི་མཆོད་པ་རྒྱ་ཆེན་རབ་ཀྱང་བྱས། །
en: {94} “The king and his sons had devotion to the Sugata, And they made vast offerings to the Jina.

source: དེ་ནི་རྟག་ཏུ་དམ་ཆོས་ཡོངས་བཟུང་པའི། །ཆོས་ལ་མངོན་བརྩོན་རབ་ཏུ་བརྟན་པར་གྱུར། །
en: He was always in possession of the good Dharma And unshakably dedicated to the Dharma.

source: རྒྱལ་པོ་དེ་སྲས་འོད་གཟེར་བཟང་པོ་ནི། །སེམས་ཅན་རྣམ་དག་གཞོན་ནུ་འཁྲུངས་གྱུར་པ། །ཤིན་ཏུ་བལྟ་མཛེས་ཡིད་འོང་གཟུགས་ལྡན་ཏེ། །ཡན་ལག་མཚན་རབ་སུམ་ཅུ་གཉིས་ཀྱིས་བརྒྱན། །
en: {95} “To that king was born a son Named Prince Suraśmi, a pure being Who was a delight to see and had a beautiful form And was adorned by the thirty-two supreme signs.

source: རྒྱལ་སྲིད་ཡོངས་སུ་སྤངས་ནས་མི་ཡི་འཁོར། །བྱེ་བ་ལྔས་བསྐོར་དེ་ཚེ་རབ་ཏུ་བྱུང་། །
en: {96} “He abandoned the kingdom and entered homelessness Accompanied by an entourage of fifty million men.

source: རབ་ཏུ་བྱུང་ནས་བརྩོན་འགྲུས་བརྟན་ལྡན་ཏེ། །རྒྱལ་བའི་ཆོས་ཀྱང་ཡོངས་སུ་གཟུང་བར་གྱུར། །
en: As a mendicant, he was dedicated with unwavering diligence And gained completely the Dharma of the Jina.

source: ཕོ་བྲང་དམ་པ་སྡོང་པོ་ལྡན་པ་ནི། །གྲོང་མཆོག་བྱེ་བ་སྟོང་གིས་ཀུན་ནས་བསྐོར། །
en: {97} “There was the city named Drumāvatī Encircled by ten billion excellent towns.

source: ནགས་ཚལ་ཡལ་ག་སྣ་ཚོགས་དེར་བྱུང་བ། །རབ་ཏུ་སྒྲ་ཞི་བླ་ན་མེད་པའི་དཔལ། །
en: There were forests with a variety of branches, Peaceful and silent, with unsurpassable splendor.

source: དེ་ན་འོང་བཟང་བརྟུལ་ཞུགས་རབ་ལྡན་པ། །འཇིགས་མེད་ཤེས་རབ་སྤོབས་དང་ལྡན་པ་བཞུགས། །
en: {98} “There, with perfect discipline, dwelled Suraśmi, Who was fearless, wise, and eloquent.

source: དེས་ནི་སེམས་ཅན་ཉོན་མོངས་སྦྱངས་པའི་ཕྱིར། །རྒྱལ་པའི་ཆོས་ཀྱང་ཡོངས་སུ་བསྟན་པ་མཛད། །
en: He was teaching the Dharma of the Jina In order to purify defiled beings.

source: ཤེས་རབ་ལྡན་པ་དེ་ནི་བསོད་སྙོམས་ལ། །སྤྱོད་ལམ་མཛེས་ཤིང་ཆ་བྱད་ཞི་བ་དང་། །
en: {99} “That wise one, when seeking alms, Had a beautiful conduct and peaceful appearance.

source: མི་གཡེང་སྤྱན་གྱིས་དགོངས་པ་མཁྱེན་བཞིན་དུ། །ཚུལ་ཟབ་བརྟན་པར་བཞུད་པས་གྲོང་དུ་བྱོན། །
en: He went into town in an unwavering, profound manner With mindfulness and undistracted eyes.

source: གྲོང་མཆོག་དགའ་བའི་རྒྱལ་མཚན་ཞེས་བྱ་བར། །ཚོང་དཔོན་ལེགས་པ་སྙན་གྲགས་དེར་བྱུང་སྟེ། །
en: {100} “In the best of towns, Nandīdhvaja, There was the head merchant Suvighuṣṭa­kīrti.

source: ཁོ་མོ་དེ་ཡི་བུ་མོ་ཡིད་འོང་གྱུར། །གཟུགས་མཛེས་ལྡན་ཏེ་ཉི་མའི་འོད་ཅེས་བྱ། །
en: I was his charming, beautiful daughter By the name of Bhānuprabhā.

source: ཁྱིམ་གྱི་དམ་པ་དེ་ཡི་སྒོ་ནས་སུ། །འོད་གཟེར་བཟང་པོ་འཁོར་བཅས་ཁོ་མོས་མཐོང་། །ཡན་ལག་མཚན་བརྒྱན་ཤིན་ཏུ་མཛེས་པ་སྟེ། །དེ་ལ་ཁོ་མོ་མོས་པ་མཆོག་ཅིག་སྐྱེས། །
en: {101} “At the gateway of our perfect house, I saw Suraśmi and his entourage, Handsome, his body adorned by the signs, And I was greatly attracted to him.

source: དེ་ནི་ཁོ་མོའི་ཁྱིམ་གྱི་སྒོར་བྱོན་ནས། །ནོར་བུ་དེ་ཡི་ལྷུང་བཟེད་ནང་དུ་གསོལ། །
en: {102} “He came to the gateway to my home, And I placed a jewel in his alms bowl.

source: རྒྱན་རྣམས་ཀུན་ཀྱང་བཀྲོལ་ཏེ་མོས་སེམས་ཀྱིས། །ཤིན་ཏུ་འདུན་པར་དེ་ལ་བདག་གིས་ཕུལ། །
en: I also removed all my jewelry, And with adoration I offered them to him.

source: བདེ་གཤེགས་སྲས་པོ་འོད་གཟེར་བཟང་དཔལ་ལ། །འདོད་ཆགས་སེམས་ཀྱིས་མཆོད་པ་རྣམས་བསྒྲུབས་པས། །བསྐལ་པའི་དམ་པ་ཉིས་བརྒྱ་ལྔ་བཅུར་ཡང་། །ངན་སོང་གང་དུའང་སོང་བར་མ་གྱུར་ཏོ། །
en: {103} “Because of making an offering through passion To that son of the buddhas, Suraśmiketu, For two hundred and fifty of the longest kalpas I was not reborn in the lower existences.

source: ལྷ་ཡི་ཡུལ་དུ་ལྷ་རིགས་ལྡན་པར་སྐྱེས། །མི་ཡི་ཡུལ་དུ་རྒྱལ་པོའི་སྲས་མོར་གྱུར། །
en: {104} “I was born into divine families in the realms of the devas And in the human world as the daughters of kings.

source: ཁ་དོག་མཐའ་ཡས་སྐུ་ཡི་མདོག་མངའ་བས། །ཀུན་ཏུ་ཁོ་མོ་མངོན་པར་ཞལ་ཡང་བསྟན། །
en: In all those lives he revealed himself to me In bodies that had endless different forms.

source: བསྐལ་པ་ཉིས་བརྒྱ་ལྔ་བཅུ་འདས་གྱུར་ནས། །སྤྲུལ་འཚོང་གཙོ་མོ་བལྟ་ན་སྡུག་པ་སྟེ། །མི་འཇིགས་བྱེད་པའི་བུ་མོར་སྐྱེས་པར་གྱུར། །དེ་ཚེ་ཤིན་ཏུ་སྦྱངས་ཤེས་བྱ་བ་ཡིན། །
en: {105} “After two hundred and fifty kalpas had passed, I was born as the fearless daughter Of the preeminent courtesan Sudarśanā And at that time was known as Saṃcālitā.

source: རྒྱལ་བུ་གཟི་བརྗིད་འོད་ཀྱི་བདག་མཐོང་ནས། །ཁོ་མོས་དེ་ལ་དགའ་བས་མཆོད་པ་བྱས། །
en: {106} “When I saw Prince Tejodhipati, I joyfully made offerings to him.

source: བདག་ཉིད་དེ་ལ་ཡོངས་སུ་དབུལ་བྱས་ནས། །ཁོ་མོ་དེ་ཡི་དབང་གྱུར་ཆུང་མར་གྱུར། །
en: I offered myself to him And became his obedient wife.

source: དྲང་སྲོང་ཆེན་པོའི་སྐུ་མཆོག་ཉི་མ་ལའང་། །བདག་ཅག་བསྡོམས་ཏེ་ལེགས་པར་མཆོད་པ་བྱས། །
en: {107} “Together we made excellent offerings To the great ṛṣi Sūrya­gātra­pravara.

source: མོས་པས་སངས་རྒྱས་དེ་ཡི་ཞལ་བལྟས་ནས། །བདག་གིས་བྱང་ཆུབ་མཆོག་ཏུ་སེམས་ཀྱང་བསྐྱེད། །
en: With devotion I looked upon that buddha’s face, And I developed the aspiration for supreme enlightenment.

source: རྒྱལ་པ་བྱེ་བ་དྲུག་ཅུ་ཚང་པ་ཡང་། །བསྐལ་བ་དེ་ལ་ཁོ་མོས་རིམ་གྲོ་བྱས། །
en: {108} “During that kalpa, I venerated A full six hundred million jinas.

source: རྒྱལ་བ་དེ་དག་ཐ་མའི་དུས་ཀྱི་ཚེ། །སངས་རྒྱས་མོས་པའི་གཟི་བརྗིད་བྱུང་བར་གྱུར། །
en: In the time of the last of those jinas There appeared the Buddha Adhimuktitejas.

source: དེར་ནི་ཁོ་མོའི་ཆོས་མྱིག་རྣམ་པར་དག །ཆོས་ཀྱི་རང་བཞིན་བདག་གིས་ཁོང་དུ་ཆུད། །
en: {109} “In that time, I gained pure Dharma eyes And comprehended the nature of phenomena.

source: ཚུལ་མྱིན་རྣམ་རྟོགས་རབ་ཏུ་ཞི་བར་གྱུར། །
en: Incorrect thinking completely ceased, And since that time I have attained illumination.

source: དེ་ཚེ་ཚུན་ཆད་ཁོ་མོས་སྣང་བ་ཐོབ། །རྒྱལ་སྲས་རྣམས་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་ཡང་། །དེ་ཕྱི་ཚུན་ཆད་རྣམ་པར་མཐོང་བར་གྱུར། །
en: {110} “Since that time, I have seen The samādhis of the jinas’ progeny.

source: སེམས་ཀྱི་སྐད་ཅིག་གཅིག་གིས་རྒྱ་མཚོའི་ཞིང་། །བསམ་ལས་རྣམ་འདས་ཕྱོགས་སུ་ཁོ་མོ་འཇུག །
en: In each instant of the mind I observe An inconceivable ocean of realms in all directions.

source: ཕྱོགས་རྣམས་ཀུན་གྱི་སྣ་ཚོགས་རྣམ་དག་པའི། །ཞིང་རྣམས་ཚད་མེད་རྨད་མཐོང་ཁོ་མོས་མཐོང་། །
en: {111} “I see in all directions a variety Of countless, marvelous pure realms.

source: མཐོང་ཡང་དེ་དག་ལ་ནི་ཆགས་པ་མེད། །ཉོན་མོངས་བཅས་ལའང་ཁོང་ཁྲོ་སྡང་བ་མེད། །
en: I have no attachment to them on seeing them And no aversion toward those that are defiled.

source: ཞིང་རྣམས་དེ་དག་མ་ལུས་ཐམས་ཅད་ཀྱི། །སྙིང་པོ་བྱང་ཆུབ་སངས་རྒྱས་མ་ལུས་མཐོང་།
en: {112} “I see, in every one of those realms, Every buddha in his bodhimaṇḍa.

source: དེ་དག་འོད་ཀྱི་རྒྱ་མཚོ་ཚད་མེད་པའང་། །སེམས་ཀྱི་སྐད་ཅིག་གཅིག་གིས་རྣམ་པར་བལྟ། །
en: In each instant of mind I look upon Their immeasurable oceans of light.

source: དེ་དག་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་ཡང་། །སེམས་ཅིག་ཐོགས་པ་མེད་པས་ཁོང་དུ་ཆུད། །
en: {113} “In each instant of mind I comprehend, without impediment, The oceans of their circles of followers.

source: རྣམ་པར་ཐར་པ་ཚད་མེད་ཐམས་ཅད་དང་། །དེ་དག་ཏིང་འཛིན་མ་ལུས་དེ་བཞིན་ཤེས། །
en: In the same way, I know all their samādhis And also their countless liberations.

source: དེ་དག་སྤྱོད་པ་ཡངས་པའང་ཁོང་དུ་ཆུད། །ས་ཚུལ་མ་ལུས་ཀུན་ཀྱང་ཁོ་མོས་ཤེས། །
en: {114} “I comprehend their vast activities, And I know every manner of the bhūmis.

source: སྨོན་ལམ་གྲགས་མེད་རྒྱ་མཚོ་ཆེན་པོ་ཡང་། །སྐད་ཅིག་རེ་རེས་མཐའ་ཡས་ཁོང་དུ་ཆུད། །
en: I also know, in each instant, the infinite, Vast ocean of their countless prayers.

source: བསྐལ་པ་མཐའ་ཡས་སྤྱད་པ་སྤྱོད་བྱེད་ཅིང་། །སྐྱེས་བུ་དམ་པའི་སྐུ་ལ་ལྟ་ལྟ་སྟེ། །
en: {115} “Throughout endless kalpas I gazed upon The body of the supreme being practicing conduct.

source: དེ་ཡི་བ་སྤུ་རྣམ་པར་འཕྲུལ་བ་ཡང་། །ནམ་ཡང་མུར་ཕྱིན་བདག་གིས་མ་ནུས་སོ། །
en: I could never fully know the extent Of the manifestations from his pores.

source: དེ་ཡི་བ་སྤུ་གཅིག་གི་རྩེ་ལ་ཡང་། །ཞིང་མང་རྒྱ་མཚོ་གྲངས་ལས་འདས་པ་མཐོང་། །
en: {116} “I saw countless oceans of many realms, Even on the tip of a single pore hair.

source: རླུང་གི་ཕུང་པོ་ཆུ་བོ་ཆེན་པོ་དང་། །ས་ཡི་ལྷུན་རྣམས་མེ་ཡིས་ཡོངས་གང་མཐོང་། །
en: I saw them filled with masses of air, Great rivers, mountains of earth, and fire.

source: གཞི་རྣམས་སྣ་ཚོགས་རྣམ་ཕྱེའི་གཟུགས་ལྡན་ཞིང་། །དབྱིབས་ཚུལ་སྣ་ཚོགས་ཁོང་དུ་ཆུད་བྱ་བ། །
en: {117} “I perceived a variety of grounds Having different forms and various kinds of shapes.

source: དབྱིབས་དང་ལུས་ཀྱི་རྣམ་པས་སྣ་ཚོགས་ཤིང་། །ལུས་དང་རྣམ་པ་མཐའ་ཡས་གཟུགས་ལྡན་པའི། །
en: They had a variety of elements and constituents, Various different kinds of aspects and forms.

source: བརྗོད་ཡས་ཁམས་རྣམས་ཞིང་རྣམས་རྒྱ་མཚོ་དག །ཚད་མེད་རྣམས་སུ་ཐ་དད་གསལ་བར་མཐོང་། །
en: {118} “I saw clearly and distinctly countless Oceans of realms, worlds beyond description.

source: ཆོས་ཀྱི་གསུང་གིས་འགྲོ་བ་གདུལ་དོན་དུ། །བརྩོན་བའི་རྒྱལ་བ་དེ་ཉིད་བཞུགས་པ་མཐོང་། །
en: I saw the jinas who were engaged In guiding beings through teaching the Dharma.

source: བསྐལ་པར་སྤྱོད་པ་ཡངས་པ་སྤྱོད་པའི་ཚེ། །སྐུ་ཡི་ཕྲིན་ལས་ཁོ་མོས་དེ་མ་ཤེས། །གསུང་དང་ཐུགས་མིན་དེ་གཉིས་ཕྲིན་ལས་མིན། །རྫུ་འཕྲུལ་རྣམ་འཕྲུལ་ཐ་དད་ཚུལ་མ་ཤེས། །
en: {119} “I cannot comprehend the actions of his body, Or his speech or his mind, or their actions, Or his various miraculous manifestations While practicing his vast conduct for kalpas.”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཤཱཀྱའི་བུ་མོ་གོ་བའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། ཤཱཀྱའི་བུ་མོ་གོ་བ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ཡང་དང་ཡང་བལྟས་ཏེ། ཤཱཀྱའི་བུ་མོ་གོ་བའི་དྲུང་ནས་སོང་ངོ་།། །།སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། བམ་པོ་བཅུ་དྲུག་པ། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལྷ་མོ་སྒྱུ་མའི་གན་དུ་འགྲོ་བར་མངོན་དུ་བལྟས་ནས། སངས་རྒྱས་ཀྱི་སྤྱོད་ཡུལ་གྱི་རྒྱུད་ཀྱི་ཡེ་ཤེས་ལ་ཞུགས་པ་དེས་འདི་སྙམ་དུ་བསམས་སོ། །བདག་གི་དགེ་བའི་བཤེས་གཉེན་འཇིག་རྟེན་ཐམས་ཅད་ལས་གྱེན་དུ་འཕགས་པའི་སྐྱེ་མཆེད་དྲུག་དང་ལྡན་པ། གནས་མེད་པ་ལ་རབ་ཏུ་གནས་པ། ཆགས་པ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པའི་ལུས་དང་ལྡན་པ། ཆགས་པ་མེད་པར་འགྲོ་བའི་ལམ་དུ་ཞུགས་པ་ཆོས་ཀྱི་ལུས་ཤིན་ཏུ་རྣམ་པར་དག་པ། ལུས་ཀྱི་ལས་སྒྱུ་མས་ལེགས་པར་སྤྲུལ་པའི་ལུས་དང་ལྡན་པ། ཡེ་ཤེས་སྒྱུ་མའི་རྣམ་པས་འཇིག་རྟེན་ན་རྣམ་པར་སྤྱོད་པ། སྨོན་ལམ་སྒྱུ་མའི་གཟུགས་དང་ལུས་སུ་ལྡན་པ། སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཡིད་ཀྱི་རང་བཞིན་གྱི་ལུས་དང་ལྡན་པ། མ་སྐྱེས་མ་འགགས་པའི་ལུས་དང་ལྡན་པ། འོངས་པ་མེད་པའི་ལུས་དང་ལྡན་པ། བདེན་པ་མེད་པ་དང་། བརྫུན་པ་མེད་པའི་ལུས་དང་ལྡན་པ། མ་འཕོས་མ་ཞིག་པའི་ལུས་དང་ལྡན་པ། མ་བྱུང་མི་འཇིག་པའི་ལུས་དང་ལྡན་པ། མཚན་ཉིད་མེད་པར་མཚན་ཉིད་གཅིག་པའི་ལུས་དང་ལྡན་པ། གཉིས་ལ་ཆགས་པ་དང་བྲལ་བའི་ལུས་དང་ལྡན་པ།
en: {120} Sudhana, the head merchant’s son, bowed his head to the feet of the Śākya maiden Gopā, circumambulated the Śākya maiden Gopā many hundreds of thousands of times, keeping her to his right, and, looking back again and again, departed from the Śākya maiden Gopā.

source: ཀུན་གཞི་མེད་པ་ལ་གནས་པའི་ལུས་དང་ལྡན་པ། མི་ཟད་ཅིང་ཉམས་པ་མེད་པའི་ལུས་དང་ལྡན་པ། གཟུགས་བརྙན་ལྟར་རྣམ་པར་རྟོག་པ་མེད་པའི་ལུས་དང་ལྡན་པ། རྨི་ལམ་དང་མཉམ་པར་རྣམ་པར་རྒྱུ་བའི་ལུས་དང་ལྡན་པ་མེ་ལོང་གི་དཀྱིལ་འཁོར་ལྟར་འཕོ་བ་མེད་པའི་ལུས་དང་ལྡན་པ། །ཕྱོགས་མེད་པ་ལྟར་རབ་ཏུ་ཞི་བར་ཁོང་དུ་ཆུད་པའི་ལུས་དང་ལྡན་པ། ཕྱོགས་ཀུན་ཏུ་རྒྱས་པར་འགེངས་པའི་ལུས་དང་ལྡན་པ། དུས་གསུམ་དུ་ཐ་མི་དད་པའི་ལུས་དང་ལྡན་པ། ལུས་མེད་པའི་སེམས་ཀྱི་ལུས་རྣམ་པར་མི་རྟོག་པའི་ལུས་དང་ལྡན་པ། འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་མྱིག་གི་ལམ་ལས་ཡོངས་སུ་འདས་པའི་ལུས་དང་ལྡན་པ། ཀུན་ཏུ་བཟང་པོའི་མྱིག་གི་རྒྱུད་ཀྱིས་རྣམ་པར་ཤེས་པར་བྱ་བས་འདུལ་བའི་ལུས་དང་ལྡན་པ། ཆགས་པ་མེད་པས། ནམ་མཁའི་སྤྱོད་ཡུལ་དང་ལྡན་པ་རྣམས་མཐོང་བར་བྱ་བའམ། བསྙེན་བཀུར་བར་བྱ་བའམ། མངོན་གསུམ་དུ་ཕྲད་པར་བྱ་བའམ། འགྲོགས་པར་བྱ་བ་འམ། མཚན་མ་གཟུང་བར་བྱ་བ་འམ། དབྱངས་ཀྱི་དཀྱིལ་འཁོར་རྣམ་པར་རིག་པར་ཤེས་པར་བྱ་བའམ། ཚིག་གི་རྒྱུད་ཡོངས་སུ་ཤེས་པར་བྱ་བའམ། གདམས་ངག་ཡོངས་སུ་གཟུང་བར་བྱ་བར་ཐབས་ཇི་ལྟ་བུ་ཞིག་ཏུ་ནུས་པར་འགྱུར་སྙམ་ནས།
en: Māyādevī Chapter 44 Sudhana, the head merchant’s son, on the way to Māyādevī, undertaking the wisdom of practicing the scope of the activity of the buddhas, thought, “By what means can I see the kalyāṇamitras, honor them, meet them, accompany them, learn their qualities, know the field of their speech, understand the succession of their words, and possess the teachings of the kalyāṇamitras who have six āyatanas that have risen above all worlds; who have bodies that have transcended all attachments; who follow the path of unimpeded movement; who have pure Dharma bodies; who have bodies that are manifestations of illusory physical activities; who perform conducts in the world that are the illusions of wisdom; who have forms and bodies from prayer; who have bodies that are not born and do not cease; who have bodies that are neither true nor false; who have bodies that do not pass away or perish; who have bodies that do not originate and are not destroyed; who have bodies that have the single characteristic of having no characteristics; who have bodies that have no attachment to duality; who have bodies that are based on having no basis; who have bodies that do not decay or diminish; who have bodies without thoughts, like reflections; who have active bodies that are like dreams; who have bodies that do not depart, like the surface of a mirror; who have bodies that are established in peace, like the absence of directions; who have bodies that pervade all directions; who have bodies that have no differentiation between the three times; who have bodiless bodies of mind that are bodies without thought; who have bodies that have transcended the path of sight in all worlds; who have bodies that have been tamed through the path of completely good vision; and who have the unimpeded field of activity of space?”

source: དེ་ལྟར་སེམས་ཤིང་ཡིད་ལ་བྱེད་པ་ལ་བརྩོན་པར་གནས་པའི་ཚེ། གྲོང་ཁྱེར་གྱི་ལྷ་མོ་རིན་ཆེན་མིག་ཅེས་བྱ་བ་ནམ་མཁའི་ལྷ་མོའི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་བ་ཞིག་གིས།
en: While he was dedicated to contemplating and pondering this, Ratnanetrā, the goddess of the city, appeared in the sky encircled by a crowd of sky goddesses.

source: བདག་གི་ལུས་རྒྱན་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་བརྒྱན་པ། བདག་གི་ལུས་རྒྱན་གྱིས་རྣམ་པར་ཀླུབས་པར་ནམ་མཁའ་ལ་འདུག་པར་ཉེ་བར་བསྟན་ནས། ལྷ་རྫས་ཀྱི་མེ་ཏོག་རྣམ་པ་དང་། ཁ་དོག་དུ་མ་ཅན་སྙིམ་པ་ནས་མངོན་པར་གཏོར་ཏེ།
en: Her body was adorned by varieties of jewelry, her body was covered in adornments, and she scattered handfuls of divine flowers of many shapes and colors.

source: ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་འཁོར་བའི་ཡུལ་ལ་དགའ་བར་མི་གནས་པས་སེམས་ཀྱི་གྲོང་ཁྱེར་ཡོངས་སུ་བསྲུང་བ་ལ་བརྩོན་པར་གྱིས་ཤིག །
en: She said to Sudhana, the head merchant’s son, “Noble one, you should be dedicated to protecting the city of the mind by not dwelling in delight in saṃsāra’s field of perception.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ལ་དམིགས་པས་སེམས་ཀྱི་གྲོང་ཁྱེར་བརྒྱན་པ་ལ་བརྩོན་པར་གྱིས་ཤིག །
en: “Noble one, you should be dedicated to adorning the city of the mind through focusing on the ten strengths of the tathāgatas.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཕྲག་དོག་དང་། སེར་སྣ་དང་གཡོ་དང་བྲལ་བས་སེམས་ཀྱི་གྲོང་ཁྱེར་ཡོངས་སུ་སྦྱང་བ་ལ་བརྩོན་པར་གྱིས་ཤིག །
en: “Noble one, you should be dedicated to purifying the city of the mind through being free of envy, greed, and deception.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་ངེས་པར་རྟོགས་པར་བྱ་བས་སེམས་ཀྱི་གྲོང་ཁྱེར་གྱི་ཡོངས་སུ་གདུང་བ་རབ་ཏུ་ཞི་བར་བྱ་བ་ལ་བརྩོན་པར་གྱིས་ཤིག །
en: “Noble one, you should be dedicated to pacifying the torment of the city of the mind through realizing the nature of all phenomena.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཚོགས་ལ་བརྩོན་འགྲུས་ཆེན་པོའི་ཤུགས་རྣམ་པར་སྤེལ་བས་སེམས་ཀྱི་གྲོང་ཁྱེར་རྣམ་པར་སྤེལ་བ་ལ་བརྩོན་པར་གྱིས་ཤིག །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་དང་།
en: “Noble one, you should be dedicated to increasing the city of the mind through increasing the power of great dedication to the accumulation of omniscience.

source: བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཆོས་ཀྱི་གཞལ་མེད་ཁང་ཡངས་པའི་རྣམ་པར་སྤྱོད་པ་ལ་དབང་བསྒྱུར་བས་སེམས་ཀྱི་གྲོང་ཁྱེར་དང་། གནས་ཀྱི་མཛོད་བརྒྱན་པ་དང་། བསྲུང་བ་ལ་བརྩོན་པར་གྱིས་ཤིག །
en: “Noble one, you should be dedicated to protecting the city of the mind’s treasury of buildings through gaining power over dwelling in the vast divine palaces of the samādhis, samāpattis, dhyānas, liberations, and the Dharma.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཡང་དག་པར་བསྒྲུབས་པའི་ས་ཐམས་ཅད་ཀྱི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རབ་ཏུ་ཐོབ་པར་འཚལ་བས། སེམས་ཀྱི་གྲོང་ཁྱེར་སྣང་བར་བྱ་བ་ལ་བརྩོན་པར་གྱིས་ཤིག །
en: “Noble one, you should be dedicated to illuminating the city of the mind through seeking the attainment of the perfection of wisdom of all the levels of the established circles of followers of all the tathāgatas.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཡང་དག་པར་འབྱུང་བའི་ཐབས་ཀྱི་ལམ་གྱིས་རང་གི་སེམས་ཀྱི་གྲོང་ཁྱེར་དུ་གཞོལ་བར་བྱ་བས་སེམས་ཀྱི་གྲོང་ཁྱེར་ཉེ་བར་བརྟན་པ་ལ་བརྩོན་པར་གྱིས་ཤིག །
en: “Noble one, you should be dedicated to strengthening the city of the mind through entering the city of your own mind through the path of the method of the arising of all the tathāgatas.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་དང་སྨོན་ལམ་མངོན་པར་བསྒྲུབ་པའི་སེམས་རྣམ་པར་དག་པས་སེམས་ཀྱི་གྲོང་ཁྱེར་གྱི་ར་བ་བརྟན་པ་མངོན་པར་བསྒྲུབ་པར་གྱིས་ཤིག །
en: “Noble one, you should be dedicated to creating the strong walls of the city of the mind through a pure mind that accomplishes the completely good conduct and prayers of the bodhisattvas.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཉོན་མོངས་པ་དང་། བདུད་ཀྱི་རིས་ཀྱི་སྡིག་ཏོའི་གྲོགས་པོ་དང་། བདུད་ཀྱི་འཁོར་གྱིས་མི་ཆོམས་པར་བྱ་བས་སེམས་ཀྱི་གྲོང་ཁྱེར་བརྒལ་དཀའ་བ་དང་། ཤིགས་པར་དཀའ་བ་མངོན་པར་བསྒྲུབ་པ་ལ་བརྩོན་པར་གྱིས་ཤིག །
en: “Noble one, you should be dedicated to accomplishing the inapproachability and indestructibility of the city of the mind through crushing the army of the māras, the friends of wickedness, who are on the side of the māras and the kleśas.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་སྣང་བས་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར་སེམས་ཀྱི་གྲོང་ཁྱེར་སྣང་བར་བྱ་བ་ལ་བརྩོན་པར་གྱིས་ཤིག །
en: “Noble one, you should be dedicated to illuminating the city of the mind through enlightening all beings with the illumination from the knowledge of the tathāgatas.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་ཡོངས་སུ་གཟུང་བར་སེམས་ཀྱི་གྲོང་ཁྱེར་མངོན་པར་བརླན་པ་ལ་བརྩོན་པར་གྱིས་ཤིག །
en: “Noble one, you should be dedicated to moistening the city of the mind through acquiring the rain from the clouds of the Dharma of all the tathāgatas.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བསོད་ནམས་རྒྱ་མཚོ་རང་གི་སེམས་ཀྱིས་ཡང་དག་པར་བླང་བས་སེམས་ཀྱི་གྲོང་ཁྱེར་བརྟན་པ་ལ་བརྩོན་པར་གྱིས་ཤིག །
en: “Noble one, you should be dedicated to strengthening the city of the mind through your mind’s acquisition of the ocean of merit of all the tathāgatas.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་བྱམས་པ་ཆེན་པོས་འགྲོ་བ་ཐམས་ཅད་རྒྱས་པར་དགང་བས་སེམས་ཀྱི་གྲོང་ཁྱེར་རབ་ཏུ་རྒྱས་པར་བྱ་བ་ལ་བརྩོན་པར་གྱིས་ཤིག །
en: “Noble one, you should be dedicated to increasing the city of the mind through great love pervading all beings.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་མི་དགེ་བའི་ཆོས་ཀྱི་གཉེན་པོ་ཆོས་ཀྱི་གདུགས་ཡངས་པ་བསྒྲུབ་པས་སེམས་ཀྱི་གྲོང་ཁྱེར་ཡོངས་སུ་དག་པ་ལ་བརྩོན་པར་གྱིས་ཤིག །
en: “Noble one, you should be dedicated to purifying the city of the mind through establishing the vast parasol of the Dharma as the remedy for bad qualities.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་སྙིང་རྗེ་ཆེན་པོ་ཤིན་ཏུ་ཡངས་པས་འགྲོ་བ་ཐམས་ཅད་ཀྱི་དོན་དུ་སེམས་གཡོ་བར་བྱ་བས་སེམས་ཀྱི་གྲོང་ཁྱེར་རབ་ཏུ་བསྐྱོད་པ་ལ་བརྩོན་པར་གྱིས་ཤིག །
en: “Noble one, you should be dedicated to making the city of the mind tremble through the mind trembling with vast, great compassion for the sake of all beings.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཕྱི་ནང་གི་དངོས་པོ་འགྲོ་བ་ཐམས་ཅད་ལ་ཡོངས་སུ་བསྟན་པའི་ཕྱིར་སེམས་ཀྱི་གྲོང་ཁྱེར་གྱི་སྒོ་དབྱེ་བ་ལ་བརྩོན་པར་གྱིས་ཤིག །
en: “Noble one, you should be dedicated to opening the gates to the city of the mind through providing all beings with outer and inner things.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་འཁོར་བའི་ཡུལ་ཐམས་ཅད་ལ་དགའ་བ་ལས་ཕྱིན་ཕྱོགས་སུ་བལྟ་བས་སེམས་ཀྱི་གྲོང་ཁྱེར་རྣམ་པར་དག་པར་བྱ་བ་ལ་བརྩོན་པར་གྱིས་ཤིག །
en: “Noble one, you should be dedicated to purifying the city of the mind through turning away from delighting in the sensory range of all of saṃsāra.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་མི་དགེ་བའི་ཆོས་ཀྱི་རྒྱུད་ཐམས་ཅད་མི་སྲིད་པར་བྱ་བས་སེམས་ཀྱི་གྲོང་ཁྱེར་གྱི་སྲོག་རབ་ཏུ་མཁྲང་བ་མངོན་པར་བསྒྲུབ་པ་ལ་བརྩོན་པར་གྱིས་ཤིག །
en: “Noble one, you should be dedicated to strengthening the heart of the city of the mind through making the continuity of bad actions impossible.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཚོགས་ཡང་དག་པར་བསྒྲུབ་པའི་བརྩོན་འགྲུས་ལས་ཕྱིར་མི་ལྡོག་པར་བྱ་བས་སེམས་ཀྱི་གྲོང་ཁྱེར་བརྟན་པར་བྱ་བ་ལ་བརྩོན་པར་གྱིས་ཤིག །
en: “Noble one, you should be dedicated to making the city of the mind strong through never lapsing from the diligence that accomplishes the accumulation of omniscience.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དུས་གསུམ་གྱི་དེ་བཞིན་གཤེགས་པའི་དཀྱིལ་འཁོར་ཐམས་ཅད་དྲན་པ་ཉིད་དུ་སྣང་བར་བྱ་བས་སེམས་ཀྱི་གྲོང་ཁྱེར་རབ་ཏུ་གསལ་བར་བྱ་བ་ལ་བརྩོན་པར་གྱིས་ཤིག །
en: “Noble one, you should be dedicated to illuminating the city of the mind through the illumination of remembering the field of all the tathāgatas of the three times.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོའི་མདོ་སྡེ་སྣ་ཚོགས་ཀྱི་ཆོས་ཀྱི་སྒོ་རབ་ཏུ་དབྱེ་བའི་ཡེ་ཤེས་ལ་མངོན་པར་མཁས་པར་བྱ་བས་སེམས་ཀྱི་གྲོང་ཁྱེར་རྣམ་པར་དབྱེ་བའི་ཚུལ་ལ་མཁས་པར་གྱིས་ཤིག །
en: “Noble one, you should be dedicated to being skilled in the ways of analyzing the city of the mind through being skilled in the wisdom that analyzes the Dharma gateways of the various sūtras of the Dharma wheel of all the tathāgatas.
